In [62]:
import pandas as pd
import us
from pathlib import Path
import itertools

In [181]:
data = []
for line in itertools.islice(Path('data/asec2019_pubuse.dat').open(), None):
    if line[0] == '1':
        cbsa = line[45:50]
    if line[0] == '3':
        weight = int(line[62: 62+8])
        age = line[92:94]
        householder_status = line[95:97]
        hh_status_2 = line[97]
        data.append((cbsa, weight, age, householder_status, hh_status_2))

In [340]:
data_2018 = []
for line in itertools.islice(Path('data/asec2018_pubuse.dat').open(), None):
    if line[0] == '1':
        cbsa = line[43: 43+5]
        household_weight = int(line[286: 286 + 8])
    if line[0] == '3':
#         weight = int(line[138: 138 + 8])
        weight = int(line[154: 154 + 8])
        household_nbr = line[1:6]
        age = line[43:45]
        householder_status = line[40:42]
        hh_status_2 = line[37]
        data_2018.append((household_nbr, cbsa, household_weight, weight, age, householder_status, hh_status_2))

In [380]:
data_2000 = []
for line in itertools.islice(Path('data/mar00supp.dat').open(), None):
    if line[0] == '1':
        hh_weight = int(line[286:286+8])
        cmsa = line[52:54]
        msa = line[43:47]
    if line[0] == '3':
        # weight = int(line[232:240])
        weight = int(line[65:65 + 8])
        age = line[39:41]
        householder_status = line[36:38]
        data_2000.append((cmsa, msa, hh_weight, weight, age, householder_status))

In [332]:
raw_df = pd.DataFrame(data, columns=['cbsa', 'weight', 'age', 'householder_status', 'hh_status_2'])

In [341]:
df_2018 = pd.DataFrame(
    data_2018, 
    columns=['household_nbr', 'cbsa', 'household_weight', 'weight', 'age', 'hh_status', 'hh_status_2']
)

In [382]:
df_2000 = pd.DataFrame(
    data_2000, 
    columns=['cmsa', 'msa', 'household_weight', 'weight', 'age', 'hh_status']
)

# verify stuff

In [324]:
df_2018['household_nbr'].nunique()

67909

In [325]:
df_2018['household_weight'].nunique()

48428

In [342]:
df_2018.head(30)

   household_nbr   cbsa  household_weight  weight age hh_status hh_status_2
0          00002  00000            131602  131602  16        49           1
1          00004  00000             82429   82429  10        01           1
2          00004  00000             82429   82429  12        02           2
3          00004  00000             82429   73167  00        04           3
4          00004  00000             82429  110647  00        04           3
5          00004  00000             82429  117486  00        04           3
6          00009  00000             85300   85300  11        01           1
7          00009  00000             85300   85300  12        02           2
8          00009  00000             85300   94730  05        09           5
9          00009  00000             85300   94730  04        09           5
10         00009  00000             85300   82974  03        09           5
11         00009  00000             85300   87140  01        04           3
12         00009  00000             85300   63990  00        04           3
13         00009  00000             85300   72530  00        04           3
14         00009  00000             85300   60333  00        04           3
15         00012  00000            166379  166379  12        01           1
16         00012  00000            166379  166379  12        02           2
17         00014  00000            143807  143807  04        49           1
18         00015  00000            101940  101940  17        49           1
19         00016  00000            119734  119734  15        49           1
20         00017  00000            101940  101940  17        49           1
21         00019  00000             69498   69498  06        01           1
22         00019  00000             69498   69498  07        02           2
23         00019  00000             69498   63926  00        04           3
24         00019  00000             69498   64519  00        04           3
25         00020  00000             87842   87842  09        01           1
26         00020  00000             87842   66651  02        04           3
27         00020  00000             87842   64914  00        04           3
28         00020  00000             87842   87842  10        46           7
29         00020  00000             87842   70737  01        48           7

# cbsas stuff

In [183]:
cbsas = {
    41860: 'San Francisco',
    41940: 'San Jose',
    19100: 'Dallas',
    26420: 'Houston',
    31080: 'Los Angeles',
    40900: 'Sacramento',
}

In [184]:
raw_df['cbsa'].astype(int).map(cbsas).dropna().value_counts()

Los Angeles      6573
Dallas           2907
Houston          2687
San Francisco    2016
Sacramento       1086
San Jose          788
Name: cbsa, dtype: int64

In [194]:
df_2018['cbsa'].astype(int).map(cbsas).dropna().value_counts()

Los Angeles      6379
Dallas           2991
Houston          2927
San Francisco    1979
Sacramento       1026
San Jose          817
Name: cbsa, dtype: int64

In [238]:
cmsas = {
    84: 'San Francisco',
    31: 'Dallas',
    42: 'Houston',
    49: 'Los Angeles',
    82: 'Sacramento',
}

In [383]:
msas = {
    4480: 'Los Angeles-Long Beach',
    5945: 'Orange County',
    6780: 'Riverside-San Bernadino',
    7360: 'San Francisco',
    5775: 'Oakland',
    7400: 'San Jose',
    6920: 'Sacramento',
    3360: 'Houston',
    1920: 'Dallas',
}

In [239]:
df_2000['cmsa'].astype(int).map(cmsas).dropna().value_counts()

Los Angeles      7664
San Francisco    2096
Dallas           1807
Houston          1701
Sacramento        531
Name: cmsa, dtype: int64

In [195]:
# raw_df['householder_status'].value_counts(normalize=True).sort_index()

In [187]:
# 01 = family householder, 49 = nonfamily householder
raw_df['householder_status'].isin(['01', '49']).mean()

0.37923720579008446

In [189]:
# Group quarters... I assume it's small enough to ignore.
(raw_df['householder_status'] == '51').mean()

0.0004108805614627348

In [196]:
# 01 = family householder, 49 = nonfamily householder
df_2018['hh_status'].isin(['01', '49']).mean()

0.37681859576642013

In [186]:
raw_df['hh_status_2'].value_counts(normalize=True).sort_index()

1    0.379315
2    0.191454
3    0.232980
4    0.000666
5    0.076935
6    0.069083
7    0.049361
8    0.000205
Name: hh_status_2, dtype: float64

In [171]:
ages = {
    '00': 'Not in universe',
    '01': '15 years',
    '02': '16 and 17 years',
    '03': '18 and 19 years',
    '04': '20 and 21 years',
    '05': '22 to 24 years',
    '06': '25 to 29 years',
    '07': '30 to 34 years',
    '08': '35 to 39 years',
    '09': '40 to 44 years',
    '10': '45 to 49 years',
    '11': '50 to 54 years',
    '12': '55 to 59 years',
    '13': '60 to 61 years',
    '14': '62 to 64 years',
    '15': '65 to 69 years',
    '16': '70 to 74 years',
    '17': '75 years and over',
}

In [172]:
age_groups = {
    '00': 'Not in universe',
    '01': '15-24 years',
    '02': '15-24 years',
    '03': '15-24 years',
    '04': '15-24 years',
    '05': '15-24 years',
    '06': '25-34 years',
    '07': '25-34 years',
    '08': '35-44 years',
    '09': '35-44 years',
    '10': '45-54 years',
    '11': '45-54 years',
    '12': '55-64 years',
    '13': '55-64 years',
    '14': '55-64 years',
    '15': '65-74 years',
    '16': '65-74 years',
    '17': '75+ years',
}

In [278]:
(
    (raw_df
    .assign(age_group=raw_df['age'].map(age_groups))
    .query('hh_status_2 == "1"')
    .groupby('age_group')['weight'].sum() / 100).apply('{:,.1f}'.format)
)

age_group
15-24 years     6,262,513.5
25-34 years    21,098,267.3
35-44 years    21,747,815.5
45-54 years    22,421,899.6
55-64 years    24,567,861.0
65-74 years    19,261,839.4
75+ years      14,557,908.4
Name: weight, dtype: object

In [312]:
len(df_2018)

180084

Yay, that's exactly correct.

In [352]:
'{:,.2f}'.format(df_2018['weight'].sum() / 100)

'323,156,082.86'

In [351]:
'{:,.2f}'.format(df_2018['household_weight'].sum() / 100)

'315,192,033.63'

In [348]:
df_2018.query('hh_status_2 == "1"')['weight'].sum() / 100

127601563.86

In [349]:
df_2018.query('hh_status == "01"')['weight'].sum() / 100

83087678.77

In [350]:
df_2018.query('hh_status == "49"')['weight'].sum() / 100

44498473.51

In [359]:
(
    (df_2018
    .assign(age_group=raw_df['age'].map(age_groups))
#     .query('hh_status == "01" or hh_status == "49"')
    .query('hh_status_2 == "1"')
    .groupby('age_group')['weight'].sum() / 100).apply('{:,.1f}'.format)
)

age_group
15-24 years        16,270,291.6
25-34 years        16,221,194.0
35-44 years        17,847,453.5
45-54 years        16,052,748.9
55-64 years        15,488,912.3
65-74 years        11,065,296.3
75+ years           7,201,659.5
Not in universe    27,454,007.8
Name: weight, dtype: object

In [366]:
(
    (df_2000
    .assign(age_group=raw_df['age'].map(age_groups))
    .query('hh_status == "01" or hh_status == "49"')
    .groupby('age_group')['weight'].sum() / 100).apply('{:,.1f}'.format)
)

age_group
15-24 years        13,279,629.7
25-34 years        13,326,402.5
35-44 years        14,480,964.2
45-54 years        13,055,248.1
55-64 years        12,961,148.4
65-74 years         9,214,209.5
75+ years           6,173,136.5
Not in universe    22,214,708.4
Name: weight, dtype: object

In [367]:
(
    (df_2000
    .assign(age_group=raw_df['age'].map(age_groups))
    .assign(age_label=raw_df['age'].map(ages))
    .query('hh_status == "01" or hh_status == "49"')
    .groupby('age_label')['weight'].sum() / 100).apply('{:,.1f}'.format)
)

age_label
15 years              1,649,708.7
16 and 17 years       3,224,833.3
18 and 19 years       2,738,641.9
20 and 21 years       2,359,142.4
22 to 24 years        3,307,303.3
25 to 29 years        6,138,019.6
30 to 34 years        7,188,382.9
35 to 39 years        7,444,257.0
40 to 44 years        7,036,707.2
45 to 49 years        6,748,165.9
50 to 54 years        6,307,082.2
55 to 59 years        6,619,226.5
60 to 61 years        2,503,428.1
62 to 64 years        3,838,493.8
65 to 69 years        5,127,058.8
70 to 74 years        4,087,150.7
75 years and over     6,173,136.5
Not in universe      22,214,708.4
Name: weight, dtype: object

In [254]:
def get_householder_rates(df, hh_col, hh_values, weight_col):
    df = df.copy()
    df['age_group'] = df['age'].map(age_groups)
    age_weights = df.groupby('age_group')[weight_col].sum()
#     raw_df.groupby('hh_status_2')['weight'].sum().transform(lambda x: x / x.sum())

    householder_rates = (
        df[
            df[hh_col].isin(hh_values)
        ]
         .groupby('age_group')[weight_col].sum() 
         / age_weights
    )

    # householder_rates.index = householder_rates.index.map(ages)
    return householder_rates

In [255]:
def make_df(year_df, col, hh_values, regions, region_key, weight_col='weight'):
    rates_series = {}
    for key, name in regions.items():
        df = year_df[year_df[region_key] == str(key)]
        rates_series[name] = get_householder_rates(df, col, hh_values, weight_col)

    rates_series['Overall'] = get_householder_rates(year_df, col, hh_values, weight_col)
    
    return pd.DataFrame(rates_series).applymap('{:.1%}'.format)

In [268]:
'{:,.0f}'.format(raw_df['weight'].sum() / 100)

'323,443,787'

In [269]:
'{:,.0f}'.format(df_2018['weight'].sum() / 100)

'299,499,388'

In [270]:
'{:,.0f}'.format(df_2000['weight'].sum() / 100)

'4,083,825,300'

In [271]:
'{:,.0f}'.format(df_2000['household_weight'].sum() / 100)

'269,550,178'

In [378]:
(0.07 * 1017000 
 + 0.055 * 935000 
 + 0.02 * 947000 
 + 0.02 * 1067000 
 + 0.03 * 1015000 
 + 0.06 * 764000
 + 0.07 * (357000 + 148000))

274535.0

In [256]:
make_df(raw_df, 'hh_status_2', ['1'], cbsas, 'cbsa')

,San Francisco,San Jose,Dallas,Houston,Los Angeles,Sacramento,Overall
age_group,,,,,,,
15-24 years,8.5%,14.0%,16.8%,15.4%,12.1%,23.8%,14.9%
25-34 years,39.9%,41.1%,53.8%,46.3%,39.1%,46.1%,47.1%
35-44 years,49.3%,49.2%,48.1%,49.6%,53.6%,59.0%,53.3%
45-54 years,56.2%,45.5%,60.7%,58.1%,55.5%,52.5%,55.3%
55-64 years,60.3%,58.0%,53.2%,58.8%,50.1%,45.1%,58.1%
65-74 years,55.0%,50.8%,64.0%,64.1%,56.6%,48.7%,62.0%
75+ years,68.2%,58.7%,64.4%,66.6%,60.6%,65.1%,67.8%
Not in universe,nan%,nan%,nan%,nan%,nan%,nan%,nan%

In [371]:
make_df(df_2018, 'hh_status_2', ['1'], cbsas, 'cbsa')

,San Francisco,San Jose,Dallas,Houston,Los Angeles,Sacramento,Overall
age_group,,,,,,,
15-24 years,11.6%,14.4%,13.7%,12.0%,13.4%,15.2%,14.7%
25-34 years,38.5%,36.8%,52.0%,43.4%,37.6%,41.3%,45.2%
35-44 years,50.3%,50.6%,50.2%,49.5%,50.3%,58.5%,53.1%
45-54 years,51.9%,53.5%,53.6%,55.4%,47.0%,46.3%,54.3%
55-64 years,54.4%,56.5%,59.3%,56.2%,51.1%,57.8%,57.6%
65-74 years,57.4%,56.7%,62.5%,56.4%,57.0%,55.9%,62.6%
75+ years,64.4%,59.1%,58.8%,65.0%,58.9%,58.6%,67.4%
Not in universe,nan%,nan%,nan%,nan%,nan%,nan%,nan%

In [370]:
make_df(df_2000, 'hh_status', ['01', '49'], cmsas, 'cmsa')

                San Francisco Dallas Houston Los Angeles Sacramento Overall
age_group
15-24 years             11.8%  19.0%   20.3%       13.4%      19.3%   15.2%
25-34 years             46.5%  54.7%   50.6%       45.1%      49.4%   49.3%
35-44 years             49.4%  53.7%   52.9%       52.1%      52.5%   53.5%
45-54 years             57.3%  57.9%   59.4%       58.4%      63.6%   57.1%
55-64 years             57.7%  59.2%   51.6%       54.7%      61.2%   58.1%
65-74 years             66.9%  61.4%   63.5%       59.2%      66.6%   63.6%
75+ years               65.5%  71.5%   60.4%       67.5%      68.9%   70.3%
Not in universe          nan%   nan%    nan%        nan%       nan%    nan%

In [384]:
make_df(df_2000, 'hh_status', ['01', '49'], msas, 'msa')

,Los Angeles-Long Beach,Orange County,Riverside-San Bernadino,San Francisco,Oakland,San Jose,Sacramento,Houston,Dallas,Overall
age_group,,,,,,,,,,
15-24 years,15.1%,12.9%,8.7%,7.4%,13.3%,9.2%,21.0%,18.0%,19.8%,15.2%
25-34 years,45.2%,42.6%,49.0%,46.6%,46.7%,47.7%,50.4%,49.9%,53.3%,49.3%
35-44 years,51.3%,51.4%,56.5%,47.1%,50.1%,52.5%,54.3%,54.7%,51.7%,53.5%
45-54 years,57.4%,56.9%,62.5%,58.1%,58.9%,53.0%,63.7%,59.9%,55.5%,57.1%
55-64 years,54.4%,58.0%,51.5%,58.5%,63.0%,52.5%,60.7%,53.5%,62.1%,58.1%
65-74 years,58.8%,68.3%,53.3%,71.6%,66.8%,58.2%,65.5%,59.8%,61.3%,63.6%
75+ years,63.9%,68.7%,73.5%,60.8%,74.1%,48.7%,69.2%,60.0%,67.6%,70.3%
Not in universe,nan%,nan%,nan%,nan%,nan%,nan%,nan%,nan%,nan%,nan%

In [379]:
37/45

0.8222222222222222